[
  {
    "id": "mjlsqhm",
    "author": "henrxv",
    "body": "No problem!\n\nHaha yeah the Genshin thing is crazy.. like we all complained about lack of story, slow pace etc etc and then you realize that wow it must be great to play now, imagine 5 years of content.. and then you remember you have to be X level to enjoy this, have played X amount of story, clear XY continent and.. yeah.. it ain't a good recommendation to anyone really.. like: \"yeah you should play it like a no pull account to enjoy it\" haha wild\n\nAnd sure, we are already max lvl in WuWa, they keep adding new endgame content but we only need like.. 6 characters to complete everything? And the first continent was kinda shitty so you could rush it no problem, in the end it ain't so much about exploration and story.\n\nI've seen both these games being called \"slow power creep\" games.. and well.. the longer they've been around the more you'll see it.",
    "permalink": "https://www.reddit.com/r/gaming/comments/1jjanfn/looking_for_recommendation_for_a_gatcha_game_ps5/mjlsqhm/",
    "created_utc": 1742877164,
    "score": 1,
    "subreddit": "gaming",
    "is_submitter": false,
    "parent_id": "t1_mjlqsyo",
    "depth": 4,
    "replies": []
  },
  {
    "id": "mjlsxvb",
    "author": "XIX9508",
    "body": "They also put a lot of thought on making the game look and play well so people keep coming back. It's better than the west who release some half bake trash for 90$ and has the gall to ask you to pay to play early or make the game harder/grindier so you buy mtx. Gatcha does it too but doesn't charge me 90$ and are unapologetic about what they do (because they do it well). So tell me why should I pay for the most recent ubisoft mcdouble with no meat unless I pay extra when I can go next door and get a better burger for free?",
    "permalink": "https://www.reddit.com/r/gaming/comments/1jjanfn/looking_for_recommendation_for_a_gatcha_game_ps5/mjlsxvb/",
    "created_utc": 1742877266,
    "score": 1,
    "subreddit": "gaming",
    "is_submitter": true,
    "parent_id": "t1_mjlsbok",
    "depth": 3,
    "replies": []
  },
  {
    "id": "mjlsqwo",
    "author": "CasualCereal",
    "body": "My vote goes to WuWa. It's been making all the right decisions in the past few months, and course correcting from it's rather mediocre launch to something comparable to what you can get from big Japanese developers like SEGA, Capcom and Atlus. The devs also take feedback positively and implement them in a way that doesn't excessively squeeze the players for all their worth. The gacha is also the most generous amount the three, with no weapon 50/50, higher rates for 5\\*s, lower roll count for the guarantee(10-20 less rolls than the other two games to get your guaranteed 5\\*), 5\\* dupes(up to 2 copies per 5\\*) you can buy with side currency from rolling 4\\*-5\\*s in the gacha.\n\nGenshin is great when it comes to their stories and lore, but you really have to keep in mind that they are the most predatory and nonchalant out of the three you've mentioned. Players have been giving feedback for years and almost none of it has been implemented. Play for the story and don't expect a lot on the customer care/gacha side because of the less than ideal rates, comparatively low rewards from events, and devs that implement things that 1% of the player base would enjoy(like the recent \"mail search\" feature) or implement things \"monkey paw\" style where theres a catch to what they implement.\n\nZZZ in my opinion is a very good game, just like WuWa. Gacha rates are similar to Genshin's but the devs actually feel like they genuinely care about their game. It did have a rocky start like WuWa but it's gotten fairly better over the time it's been up. Big caveat though is that it's made by the same company as Genshin's. It's great now, but it might not be in the future once the revenue for the game starts to dry up and the devs have to resort to more predatory tactics and cut corners to meet their \"revenue quota\", just like what HSR is doing.",
    "permalink": "https://www.reddit.com/r/gaming/comments/1jjanfn/looking_for_recommendation_for_a_gatcha_game_ps5/mjlsqwo/",
    "created_utc": 1742877170,
    "score": 1,
    "subreddit": "gaming",
    "is_submitter": false,
    "parent_id": "t3_1jjanfn",
    "depth": 0,
    "replies": []
  }
]